In [1]:
import pandas as pd

In [2]:
data = [[9, 8, 7], [6, 5, 4], [3, 2, 1]]

In [9]:
df = pd.DataFrame(data, index=list("321"), columns=list("ZYX"))
df

   Z  Y  X
3  9  8  7
2  6  5  4
1  3  2  1

In [4]:
df.sort_index(inplace=True)
df

   Z  Y  X
1  3  2  1
2  6  5  4
3  9  8  7

In [5]:
df.sort_values(by='3', axis=1)

   X  Y  Z
1  1  2  3
2  4  5  6
3  7  8  9

In [6]:
df.sort_values(by=["X", "Y"])

   Z  Y  X
1  3  2  1
2  6  5  4
3  9  8  7

In [7]:
df.sort_index(axis=1)

   X  Y  Z
1  1  2  3
2  4  5  6
3  7  8  9